# 整数
# 在Python中，整数可以是正数、负数或零
int1 = 1
int2 = 100
int3 = -8080
int4 = 0

print(int1)  # 输出: 1
print(int2)  # 输出: 100
print(int3)  # 输出: -8080
print(int4)  # 输出: 0

# Python 算数运算符
# + 加法: 将两个数相加
print(2 + 1)  # 输出结果 3
# - 减法: 将第一个数减去第二个数
print(1 - 2)  # 输出结果 -1
# * 乘法: 将两个数相乘
print(1 * 2)  # 输出结果 2
# / 除法: 将第一个数除以第二个数，结果为浮点数
print(1 / 2)  # 输出结果 0.5
print(type(1 / 2))  # 输出结果 <class 'float'>
# % 取模: 返回第一个数除以第二个数的余数
print(9 % 4)  # 输出结果 1
# ** 幂: 返回第一个数的第二个数次幂
print(2 ** 3)  # 输出结果 8
# // 取整除: 返回第一个数除以第二个数的整数部分
print(9 // 4)  # 输出结果 2